Tekla Open API Reference for Tekla Structures 2025
OkApplyModifyGetOnOffCancel Events
The OkApplyModifyGetOnOffCancel type exposes the following members.
Events
Name | Description
ApplyClicked
 The ApplyClicked event is raised when the Apply button is clicked.
CancelClicked
 The CancelClicked event is raised when the Cancel button is clicked.
GetClicked
 The GetClicked event is raised when the Get button is clicked.
ModifyClicked
 The ModifyClicked event is raised when the Modify button is clicked.
OkClicked
 The OkClicked event is raised when the Ok button is clicked.
OnOffClicked
 The OnOffClicked event is raised when the On-Off button is clicked.
Top
See Also
Reference
OkApplyModifyGetOnOffCancel Class
Tekla.Structures.Dialog.UIControls Namespace